src/DataProcessors/УстановкаЦенПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УстановкаЦенПродажи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЦеныПродажиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажиНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/УстановкаЦенПродажи/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	УстановкаДоступностиЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьНаСервере()
	
	ВсяНоменклатураКОбработке = НоменклатураКОбработке();

	Если ВариантУстановки = 0 Тогда
		УстановитьФиксированнуюЦену(ВсяНоменклатураКОбработке);
	ИначеЕсли ВариантУстановки = 1 Тогда
		УдалитьЦеныНоменклатуры(ВсяНоменклатураКОбработке);
	ИначеЕсли ВариантУстановки = 2 Тогда
		УстановитьЦеныНоменклатурыПроцентом(ВсяНоменклатураКОбработке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НоменклатураКОбработке()
	
	ВсяНоменклатураКОбработке = Новый Массив;
	
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		
		НоменклатураВСтроке = СтрокаСписка.Номенклатура;
		Если НоменклатураВСтроке.ЭтоГруппа Тогда
			ДополнитьМассивЭлементамиВложеннымиВГруппу(НоменклатураВСтроке, ВсяНоменклатураКОбработке);
		Иначе
			ВсяНоменклатураКОбработке.Добавить(НоменклатураВСтроке);
		КонецЕсли;
		
	КонецЦикла;
	
	//группирую массив, тк пользователь может и подобрать номенклатуру, и потом добавить единично несколько штук
	// будут дубли, которые будут дважды обработаны
	ВсяНоменклатураКОбработке = ГруппировкаМассива(ВсяНоменклатураКОбработке);
	
	Возврат ВсяНоменклатураКОбработке;
	
КонецФункции

&НаСервере
Процедура ДополнитьМассивЭлементамиВложеннымиВГруппу(ГруппаНоменклатуры, ВсяНоменклатураКОбработке)

	Выборка = Справочники.Номенклатура.Выбрать(ГруппаНоменклатуры);
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			ДополнитьМассивЭлементамиВложеннымиВГруппу(Выборка.Ссылка, ВсяНоменклатураКОбработке); 
		Иначе
			ВсяНоменклатураКОбработке.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ГруппировкаМассива(МассивНоменклатуры)
	
	СвернутыйМассив = Новый Массив;
	
	Для каждого ЭлементМассив Из МассивНоменклатуры Цикл
		Если СвернутыйМассив.Найти(ЭлементМассив) = Неопределено Тогда
			СвернутыйМассив.Добавить(ЭлементМассив);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СвернутыйМассив;
	
КонецФункции

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)
	УстановкаДоступностиЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановкаДоступностиЭлементов()
	
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0);
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
	Элементы.Дата.Доступность = (ВариантУстановки = 2);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФиксированнуюЦену(Номенклатура)
	
	Для каждого СтрокаСписокНоменклатуры Из Номенклатура Цикл
		УстановитьНовуюЦенуНоменклатуры(СтрокаСписокНоменклатуры, ФиксированнаяЦена);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЦеныНоменклатуры(Номенклатура)
	
	Для каждого СтрокаСписокНоменклатуры Из Номенклатура Цикл
		НаборЗаписейЦеныПродажи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписейЦеныПродажи.Отбор.Номенклатура.Установить(СтрокаСписокНоменклатуры);
		НаборЗаписейЦеныПродажи.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПроцент(Номенклатура)
	
	Для каждого СтрокаСписокНоменклатуры Из Номенклатура Цикл
		
		НаборЗаписейЦеныПродажи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписейЦеныПродажи.Отбор.Номенклатура.Установить(СтрокаСписокНоменклатуры);
		НаборЗаписейЦеныПродажи.Прочитать();
		
		КоличествоЗаписей = НаборЗаписейЦеныПродажи.Количество();
		
		Если КоличествоЗаписей > 0 Тогда
			ПоследняяЗаписьЦенаПродажи = НаборЗаписейЦеныПродажи.Получить(КоличествоЗаписей-1);
			ПоследняяЗаписьЦенаПродажи.Цена = ПоследняяЗаписьЦенаПродажи.Цена * (ПроцентОтТекущейЦены + 100) / 100; 
			НаборЗаписейЦеныПродажи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦеныНоменклатурыПроцентом(Номенклатура)
	
	Для Каждого СтрокаСписка Из Номенклатура Цикл
		
		ПоследняяЦена = ПолучитьПоследнююЦенуНоменклатуры(СтрокаСписка);
		
		Если ПоследняяЦена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЦена = ПоследняяЦена * (1 + ПроцентОтТекущейЦены / 100);
		
		УстановитьНовуюЦенуНоменклатуры(СтрокаСписка, НоваяЦена);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююЦенуНоменклатуры(Номенклатура)
	
	Отбор = НовыйФильтрПоНоменклатуре();
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата());
	
	ПоследняяЦена = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ДатаАктуальности,Отбор);
	
	Возврат ПоследняяЦена.Цена;

КонецФункции

&НаСервере
Функция НовыйФильтрПоНоменклатуре()
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьНовуюЦенуНоменклатуры(Номенклатура, Цена)

	МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		НоваяСтрокаНоменклатура = СписокНоменклатуры.Добавить();
		НоваяСтрокаНоменклатура.Номенклатура = ВыбранныйЭлемент;
	КонецЦикла;
КонецПроцедуры
